web/tutorials/precice/simple/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 7.8079233e-5;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 7.8079233e-5;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 7.8079233e-5;
        value		uniform 7.8079233e-5;
    }
    walls
    {
        type            epsilonWallFunction;
        value           uniform 7.8079233e-5;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 7.8079233e-5;
        value		uniform 7.8079233e-5;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
