web/tutorials/precice/simple/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
       box (-1 -2 -2) (10 0.02001 2);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }
);
